app/controllers/restaurants_controller.rb

    def category
        restaurants_by_category = Restaurant.where("category = ?", params[:category])
---
SELECT "restaurants".* FROM "restaurants" WHERE (category = 'Sushi')